[
    {
      "id": 1,
      "project_name": "JourneySync – Your Ultimate Travel Companion",
      "project_image": "https://i.ibb.co.com/0VQh9v7g/Screenshot-2025-02-05-015137.png",
      "main_technology_stack": "React, Tailwind CSS, Node.js, Express.js, MongoDB, Firebase, Stripe API",
      "brief_description": "JourneySync is a comprehensive Tourist Management System designed to enhance travel experiences by simplifying trip planning, integrating social sharing features, and providing a seamless, interactive platform for users.",
      "live_project_link": "https://journey-sync-91305.web.app/",
      "github_repository_link": "https://github.com/uthso297/JourneySync-Client.git",
      "challenges_faced": "Integrating real-time data with Firebase, handling secure payment transactions through Stripe, and managing dynamic user roles.",
      "potential_improvements": "Adding AI-powered travel recommendations, expanding the platform to include more destinations, and improving the user interface for accessibility."
    },
    {
      "id": 2,
      "project_name": "VisaGate – Your Ultimate Visa Navigator Portal",
      "project_image": "https://i.ibb.co.com/TxQQGXdd/Screenshot-2025-02-05-023229.png",
      "main_technology_stack": "React, Tailwind CSS, Node.js, Express.js, MongoDB, Firebase",
      "brief_description": "VisaGate simplifies visa management with an interactive system that provides detailed visa information, supports secure authentication, and helps users track their visa applications.",
      "live_project_link": "https://visa-navigator-portal-f4954.web.app/",
      "github_repository_link": "https://github.com/uthso297/VisaNavigator-client.git",
      "challenges_faced": "Implementing efficient visa data management, handling real-time updates and filters, and ensuring data security for users.",
      "potential_improvements": "Integrating more visa-related services, adding a language translation feature, and improving data filtering options."
    },
    {
      "id": 3,
      "project_name": "Lingo Bingo – Your Ultimate German Learning Platform",
      "project_image": "https://i.ibb.co.com/F41mW6Jc/Screenshot-2025-02-05-024215.png",
      "main_technology_stack": "React, Tailwind CSS, Firebase, React CountUp, React Icons, React Helmet Async",
      "brief_description": "Lingo Bingo is an interactive German language learning platform that offers dynamic vocabulary lessons, real-time progress tracking, and customizable lessons for users of all levels.",
      "live_project_link": "https://assignment-09-60f57.web.app/",
      "github_repository_link": "https://github.com/uthso297/LingoBingo.git",
      "challenges_faced": "Designing an intuitive learning interface, implementing dynamic progress tracking, and ensuring smooth integration of external libraries.",
      "potential_improvements": "Introducing a quiz feature for vocabulary tests, expanding to other languages, and adding social sharing features for user achievements."
    },
    {
      "id": 4,
      "project_name": "Connect Four Dots -a web based game",
      "project_image": "https://i.ibb.co.com/HZw5gJn/Screenshot-2025-02-05-031318.png",
      "main_technology_stack": "HTML, CSS, JavaScript",
      "brief_description": "Connect Four Dots is a fun and interactive web-based version of the classic Connect Four game. Players take turns to drop colored dots into a grid, aiming to connect four in a row(horizontally, vertically, or diagonally). The game offers a simple, responsive interface for an engaging experience, perfect for quick, casual gameplay.",
      "live_project_link": "https://joyful-mooncake-c54551.netlify.app/",
      "github_repository_link": "https://github.com/uthso297/Connect-four-dots.git",
      "challenges_faced": "Handling turn-based gameplay mechanics and ensuring a responsive, smooth user experience across devices.",
      "potential_improvements": "Adding Player vs Computer functionality, enhancing the UI with animations, and adding additional game modes or themes."
    }
  ]
  